class script(object):

    START_TXT = """<b>ʜᴇʏ {}, <i>{}</i>
    
ɪ ᴀᴍ ᴛʜᴇ ᴍᴏsᴛ ᴀᴅᴠᴀɴᴄᴇᴅ ᴀᴜᴛᴏ-ғɪʟᴛᴇʀ ᴇɴɢɪɴᴇ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ sᴛʀᴇᴀᴍɪɴɢ ᴄᴀᴘᴀʙɪʟɪᴛɪᴇs. 🚀

⚡ ꜰᴇᴀᴛᴜʀᴇs:
╰┈➤ ɪɴsᴛᴀɴᴛ ᴍᴏᴠɪᴇ sᴇᴀʀᴄʜ
╰┈➤ ʜɪɢʜ-sᴘᴇᴇᴅ sᴛʀᴇᴀᴍɪɴɢ
╰┈➤ ᴘʀᴇᴍɪᴜᴍ ᴀᴅ-ғʀᴇᴇ ᴍᴏᴅᴇ
╰┈➤ ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇ (ᴄᴏᴘʏʀɪɢʜᴛ ᴘʀᴏᴛᴇᴄᴛɪᴏɴ)

ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀɴᴅ ᴍᴀᴋᴇ ᴍᴇ ᴀᴅᴍɪɴ ᴛᴏ sᴛᴀʀᴛ ᴛʜᴇ ᴍᴀɢɪᴄ! ✨</b>"""

    MY_ABOUT_TXT = """<b>╭───────────━━━━━━━
├🔸 ɴᴀᴍᴇ: <a href='https://t.me/{temp.U_NAME}'>{temp.B_NAME}</a>
├🔸 ʟɪʙʀᴀʀʏ: <a href='https://kurigram.icu/'>ᴋᴜʀɪɢʀᴀᴍ</a>
├🔸 ʟᴀɴɢᴜᴀɢᴇ: <a href='https://www.python.org'>ᴘʏᴛʜᴏɴ 3.11</a>
├🔸 ᴅᴀᴛᴀʙᴀsᴇ: <a href='https://www.mongodb.com'>ᴍᴏɴɢᴏᴅʙ</a>
├🔸 sᴇʀᴠᴇʀ: <a href='https://koyeb.com'>ᴋᴏʏᴇʙ ᴀᴅᴠᴀɴᴄᴇᴅ</a>
╰───────────━━━━━━━</b>"""

    MY_OWNER_TXT = """<b>🪪 ᴏᴡɴᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ

◈ ɴᴀᴍᴇ ➜ ɪɴꜰɪɴɪᴛʏ ʙᴏᴛᴢ
◈ ᴜsᴇʀɴᴀᴍᴇ ➜ <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a>
◈ ᴄᴏɴᴛᴀᴄᴛ ➜ <a href='https://t.me/talk_mrs_bot'>@ᴛᴀʟᴋ_ᴍʀs_ʙᴏᴛ</a>

🌍 ᴘᴏᴡᴇʀᴇᴅ ʙʏ <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a></b>"""

    STATUS_TXT = """<b>🎬 ʙᴏᴛ ʟɪᴠᴇ sᴛᴀᴛɪsᴛɪᴄs

╭───────────━━━━━━━
├ 👤 ᴛᴏᴛᴀʟ ᴜsᴇʀs: <code>{}</code>
├ 💎 ᴘʀᴇᴍɪᴜᴍ: <code>{}</code>
├ 👥 ᴛᴏᴛᴀʟ ᴄʜᴀᴛs: <code>{}</code>
├ 🚀 ᴜᴘᴛɪᴍᴇ: <code>{}</code>
╰───────────━━━━━━━

🗂 ᴅᴀᴛᴀʙᴀsᴇ ᴍᴇᴛʀɪᴄs:
╭───────────━━━━━━━
├ 📁 ᴘʀɪᴍᴀʀʏ ꜰɪʟᴇs: <code>{}</code>
├ 📦 ᴘʀɪᴍᴀʀʏ sɪᴢᴇ: <code>{}</code>
├ 📂 sᴇᴄᴏɴᴅᴀʀʏ ꜰɪʟᴇs: <code>{}</code>
├ 📦 sᴇᴄᴏɴᴅᴀʀʏ sɪᴢᴇ: <code>{}</code>
╰───────────━━━━━━━</b>"""

    NEW_GROUP_TXT = """
<b>#ɴᴇᴡ ɢʀᴏᴜᴘ</b>
━━━━━━━━━━━━━━

🏷 <b>ᴛɪᴛʟᴇ</b>      : {}
🆔 <b>ɪᴅ</b>         : <code>{}</code>
🔗 <b>ᴜsᴇʀɴᴀᴍᴇ</b>   : {}
👥 <b>ᴛᴏᴛᴀʟ</b>      : <code>{}</code>
"""

    NEW_USER_TXT = """
<b>#ɴᴇᴡ ᴜsᴇʀ</b>
━━━━━━━━━━━━━━

👤 <b>ɴᴀᴍᴇ</b>       : {}
🆔 <b>ɪᴅ</b>         : <code>{}</code>
"""

    NOT_FILE_TXT = """<b>👋 ʜᴇʟʟᴏ {},

🔍 ɴᴏ ʀᴇsᴜʟᴛs ꜰᴏᴜɴᴅ ꜰᴏʀ: <code>{}</code>


💡 ᴛʀʏ ᴛʜᴇsᴇ sᴛᴇᴘs:
╰┈➤ ᴄʜᴇᴄᴋ ɪꜰ ʏᴏᴜʀ sᴘᴇʟʟɪɴɢ ɪs ᴄᴏʀʀᴇᴄᴛ.
╰┈➤ ᴜsᴇ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ + ʏᴇᴀʀ (ᴇ.ɢ. ᴀᴠᴀᴛᴀʀ 𝟸𝟶𝟶𝟿).
╰┈➤ ᴛʜᴇ ᴍᴏᴠɪᴇ ᴍɪɢʜᴛ ɴᴏᴛ ʙᴇ ʀᴇʟᴇᴀsᴇᴅ ʏᴇᴛ.

📢 ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀᴅᴍɪɴ: <a href='https://t.me/talk_mrs_bot'>@ᴛᴀʟᴋ_ᴍʀs_ʙᴏᴛ</a></b>"""
    
    IMDB_TEMPLATE = """✅ I Found: <code>{query}</code>

🏷 Title: <a href={url}>{title}</a>
🎭 Genres: {genres}
📆 Year: {year}
🌟 Rating: {rating} / 10
☀️ Languages: {languages}
📀 RunTime: {runtime} Minutes

🗣 Requested by: {message.from_user.mention}
©️ Powered by: <b>{message.chat.title}</b>"""

    FILE_CAPTION = """<i>{file_name}</i>

🚫 ᴘʟᴇᴀsᴇ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ᴄʟᴏsᴇ ʙᴜᴛᴛᴏɴ ɪꜰ ʏᴏᴜ ʜᴀᴠᴇ sᴇᴇɴ ᴛʜᴇ ᴍᴏᴠɪᴇ 🚫"""

    WELCOME_TEXT = """<b>👋 ʜᴇʟʟᴏ {mention}, ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ʙᴏʟʟʏᴡᴏᴏᴅ ᴍᴏᴠɪᴇs! 💞

ɪ ᴀᴍ ʜᴇʀᴇ ᴛᴏ ʜᴇʟᴘ ʏᴏᴜ ꜰɪɴᴅ ʏᴏᴜʀ ꜰᴀᴠᴏᴜʀɪᴛᴇ ᴍᴏᴠɪᴇs ᴀɴᴅ sᴇʀɪᴇs ɪɴsᴛᴀɴᴛʟʏ. 

🚀 ǫᴜɪᴄᴋ sᴛᴀʀᴛ:
╰┈➤ ᴊᴜsᴛ ᴛʏᴘᴇ ᴛʜᴇ ɴᴀᴍᴇ ᴏꜰ ᴛʜᴇ ᴍᴏᴠɪᴇ ʜᴇʀᴇ.
╰┈➤ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ᴛᴏ ɢᴇᴛ ꜰɪʟᴇs.
╰┈➤ ᴘʟᴇᴀsᴇ sᴘᴇʟʟ ᴛʜᴇ ɴᴀᴍᴇ ᴄᴏʀʀᴇᴄᴛʟʏ.

🌐 ᴘᴏᴡᴇʀᴇᴅ ʙʏ: <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a></b>"""

    HELP_TXT = """<b>👋 ʜᴇʟʟᴏ {}, 

ɪ ᴀᴍ ʜᴇʀᴇ ᴛᴏ ᴍᴀᴋᴇ ʏᴏᴜʀ ᴍᴇᴅɪᴀ sᴇᴀʀᴄʜ ᴇꜰꜰᴏʀᴛʟᴇss! 🍿

🚀 ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴍᴇ:
╭───────────━━━━━━━
├ 𝟷. ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀs ᴀᴅᴍɪɴ.
├ 𝟸. ᴊᴜsᴛ ᴛʏᴘᴇ ᴛʜᴇ ᴍᴏᴠɪᴇ/sᴇʀɪᴇs ɴᴀᴍᴇ.
├ 𝟹. ɢᴇᴛ ɪɴsᴛᴀɴᴛ ꜰɪʟᴛᴇʀ ʀᴇsᴜʟᴛs.
╰───────────━━━━━━━

🌟 ᴋᴇʏ ꜰᴇᴀᴛᴜʀᴇs:
╭───────────━━━━━━━
├ ⚡ sᴜᴘᴇʀꜰᴀsᴛ ᴀᴜᴛᴏ-ꜰɪʟᴛᴇʀ
├ 🎬 ɪᴍᴅʙ ᴍᴇᴛᴀᴅᴀᴛᴀ & ᴘᴏsᴛᴇʀs
├ 📥 ᴅɪʀᴇᴄᴛ ꜰɪʟᴇ sᴛʀᴇᴀᴍɪɴɢ
├ 💎 ᴘʀᴇᴍɪᴜᴍ ᴀᴅ-ꜰʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ
╰───────────━━━━━━━

ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ᴛᴏ ᴇxᴘʟᴏʀᴇ ᴍʏ ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ꜰᴇᴀᴛᴜʀᴇs! 👇</b>"""

    ADMIN_COMMAND_TXT = """<b>🛠️ ᴀᴅᴍɪɴ ᴄᴏɴᴛʀᴏʟ ᴘᴀɴᴇʟ 👇

📝 ɪɴᴅᴇxɪɴɢ & ꜰɪʟᴇs:
╭───────────━━━━━━━
├ /index - ɪɴᴅᴇx ᴀʟʟ ᴄʜᴀɴɴᴇʟ ꜰɪʟᴇs
├ /index_channels - ʟɪsᴛ ᴀᴅᴅᴇᴅ ᴄʜᴀɴɴᴇʟs
├ /delete - ʀᴇᴍᴏᴠᴇ ꜰɪʟᴇs ʙʏ ǫᴜᴇʀʏ
├ /delete_all - ᴡɪᴘᴇ ᴇɴᴛɪʀᴇ ᴅᴀᴛᴀʙᴀsᴇ
╰───────────━━━━━━━

📢 ʙʀᴏᴀᴅᴄᴀsᴛ ᴛᴏᴏʟs:
╭───────────━━━━━━━
├ /broadcast - sᴇɴᴅ ᴍsɢ ᴛᴏ ᴜsᴇʀs
├ /grp_broadcast - sᴇɴᴅ ᴍsɢ ᴛᴏ ɢʀᴏᴜᴘs
├ /pin_broadcast - ʙʀᴏᴀᴅᴄᴀsᴛ & ᴘɪɴ (ᴜsᴇʀs)
├ /pin_grp_broadcast - ʙʀᴏᴀᴅᴄᴀsᴛ & ᴘɪɴ (ɢʀᴏᴜᴘs)
╰───────────━━━━━━━

🛡️ sᴜʙsᴄʀɪᴘᴛɪᴏɴ & ꜰsᴜʙ:
╭───────────━━━━━━━
├ /add_prm - ɢʀᴀɴᴛ ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴄᴇss
├ /rm_prm - ʀᴇᴠᴏᴋᴇ ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴄᴇss
├ /set_fsub - ᴄᴏɴꜰɪɢ ꜰᴏʀᴄᴇ sᴜʙsᴄʀɪʙᴇ
├ /set_req_fsub - sᴇᴛ ᴊᴏɪɴ-ʀᴇǫᴜᴇsᴛ ꜰsᴜʙ
├ /delreq - ᴄʟᴇᴀʀ ᴘᴇɴᴅɪɴɢ ʀᴇǫᴜᴇsᴛs
╰───────────━━━━━━━

⚙️ sʏsᴛᴇᴍ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ:
╭───────────━━━━━━━
├ /stats - ᴅᴇᴛᴀɪʟᴇᴅ ʙᴏᴛ ᴀɴᴀʟʏᴛɪᴄs
├ /users - ᴅᴏᴡɴʟᴏᴀᴅ ᴜsᴇʀs ʟɪsᴛ
├ /chats - ᴠɪᴇᴡ ᴀʟʟ ᴀᴄᴛɪᴠᴇ ɢʀᴏᴜᴘs
├ /invite_link - ɢᴇɴᴇʀᴀᴛᴇ ʙᴏᴛ ɪɴᴠɪᴛᴇ
├ /leave - ᴇxɪᴛ ᴀ sᴘᴇᴄɪꜰɪᴄ ɢʀᴏᴜᴘ
├ /restart - ʜᴏᴛ-ʀᴇʙᴏᴏᴛ ᴛʜᴇ sʏsᴛᴇᴍ
╰───────────━━━━━━━</b>"""
    
    USER_COMMAND_TXT = """<b>⚡ ᴀᴠᴀɪʟᴀʙʟᴇ ᴜsᴇʀ ᴄᴏᴍᴍᴀɴᴅs 👇

╭───────────━━━━━━━
├ /start - ᴄʜᴇᴄᴋ ɪꜰ ʙᴏᴛ ɪs ᴀʟɪᴠᴇ
├ /myplan - ᴠɪᴇᴡ ʏᴏᴜʀ ᴀᴄᴛɪᴠᴇ sᴜʙsᴄʀɪᴘᴛɪᴏɴ
├ /plan - ᴇxᴘʟᴏʀᴇ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs
├ /img_2_link - ɢᴇɴᴇʀᴀᴛᴇ ᴘᴜʙʟɪᴄ ᴜʀʟ ꜰᴏʀ ɪᴍᴀɢᴇs
├ /settings - ᴄᴏɴꜰɪɢᴜʀᴇ ɢʀᴏᴜᴘ ᴘʀᴇꜰᴇʀᴇɴᴄᴇs
├ /connect - ʟɪɴᴋ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ʙᴏᴛ ᴘᴍ
├ /id - ɢᴇᴛ ᴜsᴇʀ/ᴄʜᴀᴛ ᴜɴɪǫᴜᴇ ɪᴅ
╰───────────━━━━━━━

💡 ᴛɪᴘ: ᴜsᴇ ᴛʜᴇsᴇ ᴄᴏᴍᴍᴀɴᴅs ɪɴ ʙᴏᴛ ᴘᴍ ꜰᴏʀ ʙᴇᴛᴛᴇʀ ᴘʀɪᴠᴀᴄʏ!</b>"""

    PLAN_TXT = """<b>💎 ɪɴꜰɪɴɪᴛʏ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs

ᴀᴄᴛɪᴠᴀᴛᴇ ᴘʀᴇᴍɪᴜᴍ ᴛᴏ ᴜɴʟᴏᴄᴋ ᴀ ʟɪᴍɪᴛʟᴇss sᴛʀᴇᴀᴍɪɴɢ ᴇxᴘᴇʀɪᴇɴᴄᴇ ᴡɪᴛʜ ᴇxᴄʟᴜsɪᴠᴇ ᴘᴇʀᴋs.

🌟 ᴘʀᴇᴍɪᴜᴍ ʙᴇɴᴇꜰɪᴛs:
◈ ᴀᴅ-ꜰʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ (ɴᴏ ᴀɴɴᴏʏɪɴɢ ᴀᴅs)
◈ ɪɴsᴛᴀɴᴛ ᴡᴀᴛᴄʜ & ꜰᴀsᴛ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋs
◈ ɴᴏ ꜰᴏʀᴄᴇ sᴜʙsᴄʀɪʙᴇ ʀᴇǫᴜɪʀᴇᴅ
◈ ɴᴏ ᴅᴀɪʟʏ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɴᴇᴇᴅᴇᴅ
◈ ɴᴏ sʜᴏʀᴛʟɪɴᴋs (ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs)
◈ ᴘʀɪᴏʀɪᴛʏ ᴀᴅᴍɪɴ sᴜᴘᴘᴏʀᴛ

📢 sᴜᴘᴘᴏʀᴛ ➜ <a href='https://t.me/talk_mrs_bot'>@ᴛᴀʟᴋ_ᴍʀs_ʙᴏᴛ</a>
🌍 ᴘᴏᴡᴇʀᴇᴅ ʙʏ <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a></b>"""

    
    SOURCE_TXT = """<b>📁 ʀᴇᴘᴏsɪᴛᴏʀʏ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ

◈ ᴘʀᴏᴊᴇᴄᴛ ➜ ɪɴꜰɪɴɪᴛʏ ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ᴠ𝟹
◈ sᴛᴀᴛᴜs ➜ ᴏᴘᴇɴ sᴏᴜʀᴄᴇ (ʙᴇᴛᴀ)
◈ sᴏᴜʀᴄᴇ ➜ <a href='https://github.com/ibhub0'>ɢɪᴛʜᴜʙ ʟɪɴᴋ</a>
◈ ᴅᴇᴠᴇʟᴏᴘᴇʀ ➜ <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a>

🌍 ᴘᴏᴡᴇʀᴇᴅ ʙʏ <a href='https://t.me/infinity_botzz'>@ɪɴꜰɪɴɪᴛʏ_ʙᴏᴛᴢᴢ</a></b>"""

